hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
            set_appropriate_successfully_recieved_flag();
         } else if (send_usart_data_function_g != NULL && send_usart_data_passed_time_sec >= send_usart_data_timout_sec_g) {
            send_usart_data_timer_counter_g = 0;
            if (usart_data_to_be_transmitted_buffer_g != NULL) {
               free(usart_data_to_be_transmitted_buffer_g);
               usart_data_to_be_transmitted_buffer_g = NULL;
            }

            send_usart_data_function_g();
         }

         if (successfully_received_flags_g) {
            if (read_flag_state(&successfully_received_flags_g, DISABLE_ECHO_FLAG)) {
               on_successfully_receive_general_actions(DISABLE_ECHO_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG)) {
               on_successfully_receive_general_actions(GET_CONNECTION_STATUS_AND_CONNECT_FLAG);

               if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
                  // Has already been connected
                  set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
                  GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
               } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
                  reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
                  // Connect
                  add_piped_task_to_send_into_head(CONNECT_TO_NETWORK_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags_g, GET_CONNECTION_STATUS_FLAG)) {
               on_successfully_receive_general_actions(GET_CONNECTION_STATUS_FLAG);

               if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
                  // Has already been connected
                  set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
                  GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
               } else if (is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
                  reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags_g, GET_VISIBLE_NETWORK_LIST_FLAG)) {
               on_successfully_receive_general_actions(GET_VISIBLE_NETWORK_LIST_FLAG);

               if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME)) {
                  save_default_access_point_gain();
               }
            }
            if (read_flag_state(&successfully_received_flags_g, CONNECT_TO_NETWORK_FLAG)) {
               on_successfully_receive_general_actions(CONNECT_TO_NETWORK_FLAG);

               set_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
            if (read_flag_state(&successfully_received_flags_g, CONNECT_TO_SERVER_FLAG)) {
               on_successfully_receive_general_actions(CONNECT_TO_SERVER_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
               on_successfully_receive_general_actions(BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
               on_successfully_receive_general_actions(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

               resending_requests_counter_g = 0;
               if (on_response_g != NULL) {
                  on_response_g();
                  on_response_g = NULL;
               }
            }
            if (read_flag_state(&successfully_received_flags_g, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
               on_successfully_receive_general_actions(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG);

               if (!is_usart_response_contains_element(ESP8226_RESPONSE_WIFI_STATION_MODE)) {
                  add_piped_task_to_send_into_head(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags_g, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
               on_successfully_receive_general_actions(SET_DEFAULT_STATION_WIFI_MODE_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, GET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(GET_OWN_IP_ADDRESS_FLAG);

               unsigned char some_another_ip = !is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS);
               if (some_another_ip) {
                  add_piped_task_to_send_into_head(SET_OWN_IP_ADDRESS_FLAG);
               }
            }
            if (read_flag_state(&successfully_received_flags_g, SET_OWN_IP_ADDRESS_FLAG)) {
               on_successfully_receive_general_actions(SET_OWN_IP_ADDRESS_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, CLOSE_CONNECTION_FLAG)) {
               on_successfully_receive_general_actions(CLOSE_CONNECTION_FLAG);
            }
            if (read_flag_state(&successfully_received_flags_g, SERVER_AVAILABILITY_RESPONSE_FLAG)) {
               on_successfully_receive_general_actions(SERVER_AVAILABILITY_RESPONSE_FLAG);

               if (is_usart_response_contains_element(ESP8226_RESPONSE_OK_STATUS_CODE)) {
                  GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_SET);
               } else {
                  GPIO_WriteBit(SERVER_AVAILABILITI_LED_PORT, SERVER_AVAILABILITI_LED_PIN, Bit_RESET);
               }
            }
         }

         unsigned int current_piped_task_to_send = get_current_piped_task_to_send();
         execute_function_for_current_piped_task(current_piped_task_to_send, send_usart_data_passed_time_sec);

         /*if (response_timeout_timer > TIMER6_10S && !current_piped_task_to_send) {
            response_timeout_timer = 0;

