hammer-dp-ua/WiFiMotionDetector-STM32/app/main.c
            if (read_flag_state(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG)) {
               reset_flag(&general_flags, SENDING_USART_ERRORS_OVERFLOW_FLAG);

               char request_template[] = "GET /extjs/5errors.txt HTTP/1.1\r\nHost: {1}\r\nUser-Agent: ESP8266\r\nAccept: text/html\r\nConnection: close\r\n\r\n";
               char *parameter_for_request[] = {"192.168.0.2", NULL};
               char *request = set_string_parameters(request_template, parameter_for_request);
               send_usart_get_request("192.168.0.2", "80", request, action_on_response);
            } else {
               char request_template[] = "GET /extjs/tmp.txt HTTP/1.1\r\nHost: {1}\r\nUser-Agent: ESP8266\r\nAccept: text/html\r\nConnection: close\r\n\r\n";
               char *parameter_for_request[] = {"192.168.0.2", NULL};
               char *request = set_string_parameters(request_template, parameter_for_request);
               send_usart_get_request("192.168.0.2", "80", request, action_on_response);
            }
         }*/

         check_connection_status_and_server_availability(current_piped_task_to_send);

         // LED blinking
         if (network_searching_status_led_counter_g >= TIMER3_100MS && !read_flag_state(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG)) {
            network_searching_status_led_counter_g = 0;

            if (GPIO_ReadOutputDataBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN)) {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_RESET);
            } else {
               GPIO_WriteBit(NETWORK_STATUS_LED_PORT, NETWORK_STATUS_LED_PIN, Bit_SET);
            }
         }

         if (send_usart_data_errors_counter_g > 5 || resending_requests_counter_g > 10) {
            set_flag(&general_flags_g, SENDING_USART_ERRORS_OVERFLOW_FLAG);
            send_usart_data_errors_counter_g = 0;
            resending_requests_counter_g = 0;

            delete_all_piped_tasks();
            clear_piped_request_commands_to_send();
            on_response_g = NULL;
            send_usart_data_function_g = NULL;

            successfully_received_flags_g = 0;
            sent_flag_g = 0;
         }
      } else if (esp8266_disabled_counter_g >= TIMER6_1S) {
         esp8266_disabled_counter_g = 0;
         enable_esp8266();
      }
   }
}

void check_connection_status_and_server_availability(unsigned short current_piped_task_to_send) {
   if (checking_connection_status_and_server_availability_counter_g >= TIMER6_60S && !current_piped_task_to_send) {
      checking_connection_status_and_server_availability_counter_g = 0;
      add_piped_task_to_send_into_tail(GET_CONNECTION_STATUS_FLAG);
      add_piped_task_to_send_into_tail(GET_SERVER_AVAILABILITY_FLAG);
   }
}

void execute_function_for_current_piped_task(unsigned int current_piped_task_to_send, unsigned char send_usart_data_passed_time_sec) {
   if (send_usart_data_function_g == NULL && current_piped_task_to_send) {
      if (current_piped_task_to_send == DISABLE_ECHO_FLAG) {
         execute_usart_data_sending(disable_echo, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_CONNECTION_STATUS_AND_CONNECT_FLAG ||
            current_piped_task_to_send == GET_CONNECTION_STATUS_FLAG) {
         execute_usart_data_sending(get_connection_status, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_VISIBLE_NETWORK_LIST_FLAG) {
         execute_usart_data_sending(get_network_list, 30, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CONNECT_TO_NETWORK_FLAG) {
         execute_usart_data_sending(connect_to_network, 10, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CONNECT_TO_SERVER_FLAG) {
         execute_usart_data_sending(connect_to_server, 10, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG) {
         execute_usart_data_sending(set_bytes_amount_to_send, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG) {
         final_task_for_request_resending_g = GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 5, DO_NOT_EXECUTE_FUNCTION);
         send_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
      } else if (current_piped_task_to_send == GET_CURRENT_DEFAULT_WIFI_MODE_FLAG) {
         execute_usart_data_sending(get_current_default_wifi_mode, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == SET_DEFAULT_STATION_WIFI_MODE_FLAG) {
         execute_usart_data_sending(set_default_wifi_mode, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(get_own_ip_address, 5, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == SET_OWN_IP_ADDRESS_FLAG) {
         execute_usart_data_sending(set_own_ip_address, 2, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == CLOSE_CONNECTION_FLAG &&
            (!resending_requests_counter_g || (resending_requests_counter_g && send_usart_data_passed_time_sec >= 4))) {
         execute_usart_data_sending(close_connection, 5, EXECUTE_FUNCTION);
      } else if (current_piped_task_to_send == GET_SERVER_AVAILABILITY_FLAG) {
         delete_piped_task(GET_SERVER_AVAILABILITY_FLAG);
         get_server_avalability();
      } else if (current_piped_task_to_send == SERVER_AVAILABILITY_RESPONSE_FLAG) {
         final_task_for_request_resending_g = SERVER_AVAILABILITY_RESPONSE_FLAG;
         execute_usart_data_sending(resend_usart_get_request_using_global_final_task, 5, DO_NOT_EXECUTE_FUNCTION);
         send_request(SERVER_AVAILABILITY_RESPONSE_FLAG);
      }
   }
}

void set_appropriate_successfully_recieved_flag() {
   if (read_flag_state(&sent_flag_g, DISABLE_ECHO_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(DISABLE_ECHO_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, GET_VISIBLE_NETWORK_LIST_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(GET_VISIBLE_NETWORK_LIST_FLAG, ESP8226_RESPONSE_VISIBLE_NETWORK_LIST_PREFIX);
   }
   if (read_flag_state(&sent_flag_g, CONNECT_TO_NETWORK_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(CONNECT_TO_NETWORK_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG) || read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_FLAG)) {
      if (is_usart_response_contains_element(DEFAULT_ACCESS_POINT_NAME) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_NOT_CONNECTED_STATUS)) {
         if (read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG)) {
            set_flag(&successfully_received_flags_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
         } else {
            set_flag(&successfully_received_flags_g, GET_CONNECTION_STATUS_FLAG);
         }
      } else {
         reset_flag(&general_flags_g, SUCCESSUFULLY_CONNECTED_TO_NETWORK_FLAG);
         send_usart_data_errors_counter_g++;
      }

      if (read_flag_state(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG)) {
         reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_AND_CONNECT_FLAG);
      } else {
         reset_flag(&sent_flag_g, GET_CONNECTION_STATUS_FLAG);
      }
   }
   if (read_flag_state(&sent_flag_g, CONNECT_TO_SERVER_FLAG)) {
      reset_flag(&sent_flag_g, CONNECT_TO_SERVER_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_CONNECTED, USART_OK};
      if (is_usart_response_contains_elements(data_to_be_contained, 2) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_ALREADY_CONNECTED)) {
         set_flag(&successfully_received_flags_g, CONNECT_TO_SERVER_FLAG);
      } else {
         send_usart_data_errors_counter_g++;
      }
   }
   if (read_flag_state(&sent_flag_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG)) {
      reset_flag(&sent_flag_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);

      if (is_usart_response_contains_element(ESP8226_RESPONSE_START_SENDING_READY)) {
         set_flag(&successfully_received_flags_g, BYTES_TO_SEND_IN_REQUEST_IS_SET_FLAG);
      } else {
         //resend_usart_get_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
         send_usart_data_errors_counter_g++;
      }
   }
   if (read_flag_state(&sent_flag_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG)) {
      reset_flag(&sent_flag_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);

      char *data_to_be_contained[] = {ESP8226_RESPONSE_SUCCSESSFULLY_SENT, ESP8226_RESPONSE_PREFIX};
      if (is_usart_response_contains_elements(data_to_be_contained, 2)) {
         set_flag(&successfully_received_flags_g, GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
      } else {
         //resend_usart_get_request(GET_REQUEST_SENT_AND_RESPONSE_RECEIVED_FLAG);
         send_usart_data_errors_counter_g++;
      }
   }
   if (read_flag_state(&sent_flag_g, GET_CURRENT_DEFAULT_WIFI_MODE_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(GET_CURRENT_DEFAULT_WIFI_MODE_FLAG, ESP8226_RESPONSE_WIFI_MODE_PREFIX);
   }
   if (read_flag_state(&sent_flag_g, SET_DEFAULT_STATION_WIFI_MODE_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(SET_DEFAULT_STATION_WIFI_MODE_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, GET_OWN_IP_ADDRESS_FLAG)) {
      reset_flag(&sent_flag_g, GET_OWN_IP_ADDRESS_FLAG);

      if (is_usart_response_contains_element(ESP8226_OWN_IP_ADDRESS) ||
            is_usart_response_contains_element(ESP8226_RESPONSE_CURRENT_OWN_IP_ADDRESS_PREFIX)) {
         set_flag(&successfully_received_flags_g, GET_OWN_IP_ADDRESS_FLAG);
      } else {
         send_usart_data_errors_counter_g++;
      }
   }
   if (read_flag_state(&sent_flag_g, SET_OWN_IP_ADDRESS_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(SET_OWN_IP_ADDRESS_FLAG, USART_OK);
   }
   if (read_flag_state(&sent_flag_g, CLOSE_CONNECTION_FLAG)) {
      reset_flag(&sent_flag_g, CLOSE_CONNECTION_FLAG);
      set_flag(&successfully_received_flags_g, CLOSE_CONNECTION_FLAG);
   }
   if (read_flag_state(&sent_flag_g, SERVER_AVAILABILITY_RESPONSE_FLAG)) {
      set_appropriate_successfully_recieved_flag_general_action(SERVER_AVAILABILITY_RESPONSE_FLAG, ESP8226_RESPONSE_SUCCSESSFULLY_SENT);
   }
}

void set_appropriate_successfully_recieved_flag_general_action(unsigned int flag_value, char to_be_contained_in_response[]) {
   reset_flag(&sent_flag_g, flag_value);

   if (is_usart_response_contains_element(to_be_contained_in_response)) {
      set_flag(&successfully_received_flags_g, flag_value);
   } else {
      send_usart_data_errors_counter_g++;
   }
}

void get_server_avalability() {
   char *parameter_for_request[] = {ESP8226_SERVER_IP_ADDRESS, NULL};
   char *request = set_string_parameters(ESP8226_REQUEST_GET_SERVER_AVAILABILITY, parameter_for_request);
   send_http_request(ESP8226_SERVER_IP_ADDRESS, ESP8226_SERVER_PORT, request, NULL, SERVER_AVAILABILITY_RESPONSE_FLAG);
}

void get_own_ip_address() {
   send_usard_data(ESP8226_REQUEST_GET_OWN_IP_ADDRESS);
   set_flag(&sent_flag_g, GET_OWN_IP_ADDRESS_FLAG);
}

